{"title":"The Hollow Ward","description":"A late-night voicemail from Mara pulls you into a condemned hospital where memories play back like tape - and the building wants a new caretaker.","author":"Elena Hart","nodes":{"node-1":{"title":"The Rusted Gate","narration":"The hospital rises from the scrub like a shipwrecked block of concrete, windows boarded and tagged, the old nameplate half torn away: HOLLOW WARD. Your phone says you have no signal, yet Mara's voicemail plays again as if the air itself is buffering it. Her whisper is tight with panic, and behind it you hear a slow metronome click, like a tape deck taking in breath. She says your name once, then a different voice finishes the sentence in your own tone. You came because nobody else believed her last messages, and because she never ghosts you for real. Wind threads through the fence, carrying disinfectant and damp paper, a smell that should not live outdoors. The padlock hangs open, warm against your fingers, as if someone just left. Deep inside, something knocks twice, patient, as though answering a doorbell. You have a flashlight, a pocket knife, and the ugly certainty that if you leave now, you will regret it forever.","choices":{"choice-1":{"text":"Call the police contact and wait outside"},"choice-2":{"text":"Slip inside now, following Mara's last ping"}}},"node-2":{"title":"Officer Lang Arrives","narration":"Red-and-blue light sweeps the weeds as Officer Lang's cruiser rolls up behind you. He steps out slow, hand near his holster, pretending this is routine even though his eyes keep flicking to the dark windows. Lang knows you by your first name from previous petty calls, and he clearly thinks Mara is another thrill seeker who got stuck somewhere dumb. Still, he checks the open lock, then the prints in the mud, and his face tightens. The air here is colder than the road behind you, as if the property line is a temperature boundary. When you mention the voicemail, the tiny speaker crackles - not from your phone, but from inside the building, echoing the last word. Lang's radio answers with a hiss that sounds almost like breathing. He tries a joke, but it lands flat. He asks why you did not wait for proper backup, and you realize he is trying to convince himself as much as you. The front doors are chained yet slightly ajar. A thin strip of light leaks through, the color of old bone. Lang lifts his flashlight, and the beam trembles at the edges, like it dislikes what it reveals.","choices":{"choice-3":{"text":"Show Lang the voicemail and insist on entry"},"choice-4":{"text":"Hide the voicemail, push him toward the ward"},"choice-5":{"text":"Circle to the service entrance with Lang"}}},"node-3":{"title":"Through the Service Gap","narration":"You wedge through a gap in the fence where someone cut the wire long ago. The metal scrapes your jacket with a sound like teeth. The service entrance is a concrete maw, half swallowed by ivy and debris. Inside, your flashlight makes the corridor look longer than it should, repeating shadows at angles that do not match the architecture. Someone has drawn arrows in chalk on the walls - childish triangles pointing down, down, down. You smell bleach and wet wool. There is a footprint in the dust that is not yours, the heel dragged, as if the person was pulled. Your phone vibrates once, then dies, and in the darkness you hear the voicemail again without the device - Mara whispering close to your ear. A door somewhere swings on a hinge, slow and steady, like a pendulum. The building feels full, not of people, but of attention. You tell yourself you came to find Mara, not to interpret ghost stories, yet your skin prickles in anticipation of footsteps behind you. If you call for help now, your voice will carry, and whatever is listening will know exactly where to meet you.","choices":{"choice-6":{"text":"Follow chalk arrows down into the basement"},"choice-7":{"text":"Climb the fire escape to the second floor"},"choice-8":{"text":"Message Jonah for help, then enter the lobby"}}},"node-4":{"title":"Records Under Fluorescent Buzz","narration":"The lobby is a museum of neglect: toppled chairs, a reception desk split like rotten wood, and posters about patient dignity curling off the walls. Under the buzzing fluorescent fixture, boxes of records have burst open, spilling folders like shed skin. Lang angles his light across a sign-in ledger, and the ink looks fresh enough to smear. A date from yesterday sits on the last line, written in careful block letters. Your stomach drops when you recognize Mara's handwriting from a thousand notes. Something scrapes behind the desk. Lang steps forward, boot crunching glass, and the sound travels farther than it should, as if the building is amplifying it for an audience. You catch a glimpse of a wall clock stuck at 2:17, its second hand twitching, trying to continue. The voicemail on your phone plays again, unprompted, and the metronome click matches the twitch. Lang asks you to stay close, but you can see the question in his eyes: did you bring this here. A hallway to the wards gapes ahead, and the records room door hangs open, inviting you with the soft papery smell of secrets.","choices":{"choice-9":{"text":"Search the records room for Mara's name"},"choice-10":{"text":"Play it safe and sweep the lobby first"}}},"node-5":{"title":"The Locked Ward Door","narration":"The ward door is steel, painted institutional green, with a small square of reinforced glass clouded by grime. Someone has jammed a chair under the handle from the other side, as if to keep something in. Your crowbar bites the seam and the metal groans, a human sound. Lang mutters that this is trespassing, but he does not stop you; he is staring at the glass, where a handprint blooms and fades in the fog of unseen breath. On the wall beside the door, a patient schedule remains pinned, yellowed, and the last name on the list is underlined hard enough to tear the paper: SABLE, D. As you pry, the smell changes from dust to antiseptic, sharp enough to sting. A drip hits the floor in the hall behind you, slow, rhythmic, like a heartbeat on a monitor. The chair inside shifts by itself. The handle turns a fraction, as though someone is politely trying to open it from within. Lang's radio clicks once, and a woman's voice says, very softly, \"admit.\"","choices":{"choice-11":{"text":"Force the ward door with a crowbar"},"choice-12":{"text":"Track the faint humming to the boiler room"}}},"node-6":{"title":"Basement Pipes and Chalk Marks","narration":"The basement corridor is narrower, lined with sweating pipes and electrical panels marked with symbols that are not standard warnings. The chalk arrows lead to a maintenance stairwell, but fresh footprints veer toward the boiler room where heat should be. Your flashlight catches damp streaks on the concrete, as if something wet brushed past. You hear water running, yet when you open a valve room, every faucet is dry. Somebody scratched numbers into the wall: 2, 1, 7, repeating, as if a code or a prayer. The air tastes metallic, and your tongue feels too large in your mouth. A distant thump comes from above, then a second thump that answers it, perfectly timed. You realize the building is establishing a pattern, teaching you how it speaks. When you call Mara's name, the sound returns from three directions, each slightly delayed, a chorus of you. Somewhere ahead, a door breathes out cold air, and the chalk arrow under it is thicker, darker, as if it was drawn in haste or fear.","choices":{"choice-13":{"text":"Follow the fresh footprints toward the boilers"},"choice-14":{"text":"Climb the maintenance stairs toward patient rooms"}}},"node-7":{"title":"The Tape Recorder on a Chair","narration":"In the records room, a single chair sits centered like a stage prop. On it rests a battered tape recorder, its plastic yellowed, its red record button worn smooth. The device should be dead, but its tiny light glows. Beside it, a folder is open to a photograph of Mara, her ID shot labeled VOLUNTEER, with a date from last month. A handwritten note in the margin reads: \"Subject responds to familiar voice.\" Your throat tightens. The recorder clicks once on its own, spooling tape with a dry, hungry sound. Lang reaches out, then hesitates, as if touching it will make it real. The fluorescent buzz above you grows louder, and for a moment it harmonizes with the tape hiss, shaping a word. You cannot quite hear it, but your body reacts like it did. When you lift the folder, a keycard slides out, stamped WARD ZERO, and the plastic is warm, freshly handled. The chair creaks behind you, as if someone sat down after you stood up.","choices":{"choice-15":{"text":"Press play on the tape, despite the dread"},"choice-16":{"text":"Pocket the tape and photograph every file label"}}},"node-8":{"title":"Rooms That Smell Like Bleach","narration":"The ward hallway is lined with doors numbered in chipped paint, each with a small window and a bolt that looks too heavy for patient safety. Your flashlight beam catches smears of dried disinfectant and something darker under it. The smell of bleach is strongest here, and it does not mask the underlying odor of damp fabric and old breath. In room 12, a volunteer badge lies on the floor. It is Mara's - you recognize the cracked corner from a hundred times she complained about it. Down the hall, you hear a dragging sound, wet and patient, then a pause like something listening for your reaction. Lang whispers that he thought this place was empty. His radio answers with static that rises and falls like a sigh. Your own ears pop, as if pressure is changing. A door at the far end stands open. From inside, a metronome clicks in perfect time, and you feel it in your teeth. When you take one step forward, every door in the hallway clicks once, as if they all turned their locks together.","choices":{"choice-17":{"text":"Enter room 12 where Mara once volunteered"},"choice-18":{"text":"Follow a wet dragging sound down the hall"}}},"node-9":{"title":"Boiler Hum and Cold Drafts","narration":"The boiler room should be loud, but the hum you hear is too clean, like a single note held forever. Heat radiates from pipes that look cold to the touch, and condensation beads on valves like sweat on skin. A green exit sign points toward a service hatch in the floor. Cold air pours up from its seam, carrying the smell of earth and formaldehyde. Your flashlight reveals a chain wrapped around the hatch handle, but the lock is snapped, metal bent outward, as if someone tore it open in a hurry. The chain sways slightly though there is no draft. Lang, if he is with you, hovers near the breaker box. If you are alone, the silence feels thicker, like a hand over your mouth. Either way, your phone emits a brief tone - not a notification, but a recording beep. The hum shifts, becoming almost musical. Somewhere overhead, footsteps cross the floor in a slow circle, matching the rhythm. The building is counting you in.","choices":{"choice-19":{"text":"Open the service hatch that breathes cold air"},"choice-20":{"text":"Cut the power and listen for footsteps"}}},"node-10":{"title":"A Voice That Knows Your Name","narration":"The tape recorder plays before you fully commit. A woman's voice begins with gentle therapy cadence, then the words distort into Mara's whisper, then into your own voice saying a sentence you have never spoken. Your name arrives like a finger pressed to your lips. The sound is so close you turn, expecting someone behind you, but there is only a blank wall and the feeling of breath. The metronome click is steady: 2:17, 2:17, 2:17. Each click makes the lights flicker a fraction, and in the flicker you see a hallway that is not there, extending into blackness. Your phone screen lights without waking, recording audio on its own. In the waveform you see spikes that match your heartbeat, even when you hold your breath. Lang's face goes pale. Jonah's text, if you sent it earlier, arrives late: \"On my way. Don't play anything.\" The tape reverses with a violent snap, and the voice asks a question you do not remember hearing, yet your mouth starts to answer anyway.","choices":{"choice-21":{"text":"Answer the unseen voice with your real name"},"choice-22":{"text":"Stay silent and record the sound on your phone"}}},"node-11":{"title":"The Wall of Patient Photos","narration":"A corridor ends at a wall covered in patient photographs, hundreds of faces pinned in neat rows, each with a name tag and a date. The air here is colder, as if the smiles and stares are absorbing heat. Many photos are old, black-and-white, eyes blown out by flash. But the newest row is color, and one spot is empty as if a picture was just removed. Sticky residue glints under your light. You scan names until the letters blur. Then you see it: Mara's face, taken from a distance, her expression turned toward something off-camera with raw terror. Her name is typed beneath, but the date is wrong - it is tomorrow. Your stomach flips. A small camera on the ceiling tilts with a faint motor whine, following you though the power should be dead. Behind you, papers rustle as if turned by an invisible hand. A file folder slides from a shelf and lands open at your feet. Inside is a consent form signed in Mara's handwriting. The witness line is signed: D. Sable.","choices":{"choice-23":{"text":"Compare photos until you find Mara's face"},"choice-24":{"text":"Rip down the newest photo and keep moving"}}},"node-12":{"title":"The Tunnel Toward the Morgue","narration":"The service hatch opens with a reluctant screech. A ladder descends into a tunnel where the walls are raw earth held back by old timber. Your flashlight beam swallows itself after a few meters, as if the dark has texture. Spray-painted on the first post is a crude arrow and the word MORGUE. Another mark beside it looks like a circle with a slash, the same symbol you saw on the basement panels. The air is damp and smells like pennies and disinfectant. Somewhere ahead, water drips at irregular intervals, like a person trying to speak in Morse code. Halfway down, you find a strand of hair caught on a nail, long and dark like Mara's. Your chest tightens with the awful relief of proof. Then the tunnel shudders, a tiny settling movement, and dust falls into your eyes. For an instant you hear footsteps behind you on the ladder. When you spin, the ladder rungs are empty, but the hatch above is closing inch by inch, as if pulled by patient fingers. You realize you are choosing whether to go deeper or retreat while you still remember the way back.","choices":{"choice-25":{"text":"Crawl into the tunnel toward the morgue sign"},"choice-26":{"text":"Turn back and follow the chapel icon instead"}}},"node-13":{"title":"Jonah's Flashlight and EMF Meter","narration":"Jonah appears like a human anchor, his flashlight bright and steady, his backpack clinking with gear. He laughs once when he sees you, the laugh too loud in the empty building, then stops when his EMF meter jumps. He is an urban explorer, not a believer, but he has rules: never split up, never touch unknown devices, never follow voices. He asks about Mara, and when you tell him about the tape, his jaw tightens. The EMF meter spikes toward a closed door marked ADMIN. The needle does not wobble; it points like a compass. Jonah pulls out a small can of chalk and marks your route, practical and calming. From down the hall, a child's cry echoes, then repeats, exactly the same length and pitch, like a sample triggered twice. Jonah flinches despite himself. He offers you a spare headlamp and tells you that whatever is here is manipulating sound and expectation. Yet, as he says it, your phone records again, and the waveform forms a perfect word shape. Jonah asks what the building wants. The question hangs in the air like bait.","choices":{"choice-27":{"text":"Trust Jonah's readings and head for Sable's office"},"choice-28":{"text":"Ignore the meter and follow the crying child"}}},"node-14":{"title":"Lang Hears Static in the Dark","narration":"Lang's radio becomes a living thing. Static swells, then compresses into syllables, then breaks apart again. He taps the speaker, curses, tries another channel. The radio answers with your own voice saying, \"I'm here.\" Lang's knuckles go white around the handset. He forces a smile, but sweat beads at his hairline despite the cold. The hallway lights flicker in sync with the radio pulses, and each pulse makes the shadows shift to new positions, as if the building is rearranging pieces on a board. A door down the hall creaks open two inches. Through the gap you see darkness and the faint glow of a candle that should not exist. Lang says he wants to call for backup, but his mouth moves a half second after the words come out, like bad dubbing. You realize the building is learning to puppet voices. On the wall beside you, the number 217 is scratched again and again. Lang's radio, in a woman's calm voice, gives directions: \"Proceed to chapel. Do not look at the mirrors.\" Lang looks at you, and for the first time he believes you. The question is whether fear will make him cling to rules or to you.","choices":{"choice-29":{"text":"Keep Lang close and move toward the chapel"},"choice-30":{"text":"Separate briefly to check the office doors"}}},"node-15":{"title":"Drawers That Slide by Themselves","narration":"The morgue door is warped, but it opens easily, like it has been waiting. Metal drawers line the walls, some labeled, some blank. The air is dry and cold enough to sting your lungs. Your flashlight catches fresh scratches on one drawer handle, long grooves as if something inside dragged nails across the metal. Another drawer is slightly ajar, a dark gap breathing out the smell of formaldehyde and wet soil. A gurney sits in the center of the room. On it lies a sheet folded neatly, too neat, as if placed with ceremony. Under the sheet, something shifts, just once, like a chest taking a shallow breath. You step back, and a drawer slides open by itself with a smooth, practiced motion. Inside is not a body, but a stack of cassette tapes labeled in tidy handwriting: \"ECHO SESSIONS.\" One tape has Mara's name. The room's overhead light, which should be dead, clicks on with a sickly yellow glow. In that light you see your own reflection in the drawer handle, distorted, and behind your reflection stands someone else, motionless, head tilted. When you spin, the room is empty. The drawer slides shut with the finality of a lock.","choices":{"choice-31":{"text":"Pull open the drawer that has fresh scratches"},"choice-32":{"text":"Back away and take the side door to the chapel"}}},"node-16":{"title":"Dr. Sable's Office of Echoes","narration":"Dr. Sable's office still smells faintly of cologne and old paper, a personal scent in a place that should be sterile. A desk sits against the wall beneath framed diplomas. The names on the diplomas are real, but the dates are wrong, shifting if you look away. On the desk is an open journal. The handwriting is elegant, clinical, and hungry. Sable writes about \"echo therapy,\" about using familiar voices to coax patients into compliance, about recording memories until they can be replayed and rewritten. A keycard rests on the journal like a bookmark: WARD ZERO. Beneath it is a small mirror with hairline cracks. Someone has written on the glass in marker: \"DO NOT ANSWER.\" In the corner, a vent rattles softly, and from it you hear a melody that matches the voicemail background noise. It is not a song you recognize, yet it feels like you have always known it. When you touch the journal, the pages flip backward on their own, stopping at a sketch of a patient room with an observation window. Under the sketch is Mara's name and a time: 2:17. Your phone vibrates without service, as if acknowledging a scheduled appointment.","choices":{"choice-33":{"text":"Read Sable's journal and take the keycard"},"choice-34":{"text":"Listen at the wall vent for Mara's humming"}}},"node-17":{"title":"The Shadow That Copies Your Steps","narration":"The shadow appears where your flashlight does not reach. It is shaped like a person, but its edges are too sharp, like a cutout. When you move, it moves a beat later, copying you with imperfect delay. At first you think it is your own shadow thrown wrong by the broken lights. Then it steps when you do not, and your stomach drops as if on an elevator. The air around it is colder, and you smell damp wool and something sweet, like rot. When it opens its mouth, the sound that comes out is your own voice saying Mara's name with unbearable tenderness. Your flashlight flickers. For a split second the shadow resolves into a patient gown, face blurred as if rubbed away, wrists stained where restraints once bit. You hear footsteps that match your cadence too perfectly. The shadow lifts a hand, mirroring your gesture, fingers too long. This thing is not chasing you; it is practicing being you, and the moment it learns enough, it may not need you anymore.","choices":{"choice-35":{"text":"Offer your flashlight beam to the shadow figure"},"choice-36":{"text":"Sprint past it toward the emergency stairs"}}},"node-18":{"title":"The Chapel with Salt Circles","narration":"The chapel is small and wrong for a hospital, a pocket of stained glass and cracked pews wedged between wards. Candles sit on the altar, lit and dripping, even though there is no flame. The wax smells like honey and smoke. A circle of salt surrounds the altar, thick and deliberate. Someone has carved the number 217 into the wood in careful strokes. Inside the circle, the air shimmers, warping your flashlight beam. On a pew lies a bundle of patient bracelets threaded onto twine like rosary beads. One bracelet has Mara's name. Another has yours, printed in fresh ink. A hymn book lies open to a page marked with dried blood. The words are smudged, but the chorus repeats: \"Return what was borrowed.\" You hear the metronome click again, now coming from beneath the floorboards, and the salt circle trembles as if something underneath is pressing up. If Lang is with you, he refuses to step over the salt. If Jonah is with you, he wants to test it, to measure it. Either way, the chapel feels like a boundary line, the kind you cross only once. The building is offering you a ritual without explaining the price.","choices":{"choice-37":{"text":"Break the salt circle and step onto the altar"},"choice-38":{"text":"Keep the circle intact and follow hidden stairs"}}},"node-19":{"title":"Elevator Drop to Ward Zero","narration":"The elevator doors yawn open with a sigh. Inside, scratched steel and a mirror reflect you a fraction too late. The panel shows three floors, but a fourth button has been added with tape and marker: WARD ZERO. When you press it, the light turns red like a wound. The car drops with a sudden lurch, faster than gravity should allow, and your stomach floats. The indicator spins, then stops at 0, a level the building should not have. Halfway down, the lights flicker and you see other faces in the mirror behind you, crowded close, watching. They vanish when the lights steady, but the sense of being observed remains. A speaker crackles overhead. Dr. Sable's voice welcomes you to your appointment at 2:17. The metronome click joins the machinery hum, synchronized, as if the whole building is an instrument. The doors open on a hallway that looks freshly painted. Someone has been maintaining this. Someone has been expecting you.","choices":{"choice-39":{"text":"Ride the elevator deeper, refusing to look away"},"choice-40":{"text":"Pry the doors open and crawl into the shaft"}}},"node-20":{"title":"Singing Behind the Vent Grates","narration":"The singing threads through the vent grates - Mara's voice, or a perfect replica, humming the melody that haunted the voicemail. You press your ear to the metal, feeling the vibration like a pulse. The vents lead through narrow service corridors where handwritten notes cover the insulation: \"DO NOT ANSWER,\" \"DO NOT LOOK BACK,\" \"BURN THE TAPES.\" At an intersection, the duct splits. One path blows warm air that smells like soap. The other exhales cold that smells like soil. The humming continues down both, slightly out of sync, like stereo channels drifting. A smear of lipstick marks the grate, a color Mara wore when she wanted to feel brave. Beside it, a long fingernail scratch runs frantic and deep. Behind you, the corridor lights blink, and each blink shortens the hallway, as if the building is editing space. Following the song will bring you closer to Mara, but also deeper into whatever has learned to use her voice as a key.","choices":{"choice-41":{"text":"Follow the singing into the repeating hallway"},"choice-42":{"text":"Trace the vent route to the observation rooms"}}},"node-21":{"title":"The Apparition Offers a Trade","narration":"The apparition steps out of a doorway as if it has been waiting. It wears a doctor's coat, but the fabric drips like wet paper. Its face is blurred, features shifting as though the building cannot decide which memory to display. When it speaks, the voice is Dr. Sable's, layered with whispers underneath. It calls you \"visitor\" first, then corrects itself: \"replacement.\" It gestures to a wall mirror. In the glass you see Mara, seated in a bright room, hands folded, eyes wide. She looks up as if she hears you, the image stuttering like a bad recording. Sable explains that the ward cannot hold echoes without a keeper. Mara resisted, so it is negotiating. The trade is simple and cruel: something of yours for something of hers - a memory, a promise, a piece of blood. The metronome click slows, waiting for your answer. You realize this is not a ghost; it is a procedure wearing a face, and it knows exactly what you are afraid to lose.","choices":{"choice-43":{"text":"Accept the trade and ask where Mara is"},"choice-44":{"text":"Reject it and demand to free the trapped souls"}}},"node-22":{"title":"Hallways That Reset When You Blink","narration":"Ward Zero looks normal until you blink. The hallway extends, doors evenly spaced, the same institutional green, the same numbers. But when you turn your head, the numbering changes. Room 12 becomes room 3. The exit sign points in a new direction. You try to mark the wall with chalk, but the mark fades as if erased by humidity. Your phone clock reads 2:17 and refuses to tick forward. The metronome click is gone; the entire hallway is the metronome now, each light flicker a beat. You take ten steps and recognize the same torn poster you passed already. A drip falls from the ceiling and hits your shoulder, icy. When you look up, the tile is dry. From one of the doors, you hear your own voice speaking, having a conversation you do not remember. It sounds intimate, like confession. Another door leaks Mara's humming. You realize the ward is looping you until you make a choice it can use. The more you hesitate, the more the space resets, sanding down your resolve. In the mirror at the end of the hall, your reflection smiles a half second before you do. It is learning the timing.","choices":{"choice-45":{"text":"Mark the walls with blood to keep direction"},"choice-46":{"text":"Let the hallway reset and follow the intercom"}}},"node-23":{"title":"Choose Who to Pull Back","narration":"A crash echoes, metal on concrete, and then the unmistakable shout of Lang or Jonah, cut short. The sound comes from a cross-corridor that was not there a moment ago. When you sprint toward it, the hallway seems to lengthen, dreamlike. A door swings on its hinge, the inside black. On the floor is a dropped flashlight, still on, its beam pointing at smeared handprints dragging downward. A voice from the darkness calls your name, begging, but the pitch wavers like a tape slowed by a dying battery. Another sound, steadier, carries Mara's humming, drawing you the other way. Your chest hurts with the split. If you chase Mara now, you may lose the other person forever. If you pull the other person back, you may arrive too late to stop what is happening to her. The ward seems to lean in, listening, as if it feeds on triage. This is no longer about directions. It is testing what you will sacrifice without being asked twice.","choices":{"choice-47":{"text":"Rescue Lang first, even if Mara waits"},"choice-48":{"text":"Chase Mara's footsteps, leaving the others behind"}}},"node-24":{"title":"Mara Behind the One-Way Mirror","narration":"You find the observation room because the glass is too clean. A wide, one-way mirror spans the wall, and on the other side is a brightly lit patient room that looks freshly occupied. Mara sits in the center chair, hands folded, eyes fixed on the mirror. Her lips move in time with the metronome click you now feel inside your skull. When you whisper her name, her eyes snap to the exact spot where you stand, even though she should not see you. Relief floods her face, then turns to warning. She shakes her head, pleading without sound. A ceiling speaker crackles. Dr. Sable's calm voice asks her to repeat the memory. Mara's mouth opens, and your own voice comes out of her throat, repeating a private sentence you once told her. A thin line of blood runs from her ear. She taps the chair arm twice, then once, then seven times - 2:17. The code scratched everywhere. She draws a symbol on the fogged glass with her finger: a circle with a slash. Do not answer. The mirror between you feels less like glass and more like a membrane, waiting to be punctured.","choices":{"choice-49":{"text":"Speak to Mara through the glass, calm and steady"},"choice-50":{"text":"Smash the mirror now and pull her out"}}},"node-25":{"title":"The Mirror, the Knife, the Promise","narration":"The mirror is older up close, its surface spiderwebbed with micro-cracks that catch the light like frost. Someone has wedged a scalpel into the frame, blade clean, handle sticky. The ward wants blood; you can feel it in how the air pressures your skin. Mara watches from the other side, shaking her head harder now. She presses her palms to the glass and mouths a word you cannot hear. Her breath fogs a circle, and in that fog she draws a simple symbol: a circle with a slash. Do not answer. Do not cross. The intercom clicks on. Dr. Sable's voice congratulates you on reaching the final stage and offers reassurance like a sedative: \"We can discharge her. We can discharge you.\" Your pocket knife feels suddenly important. The scalpel handle seems to pulse, as if it has a heartbeat. You can cut your palm and seal the mirror with blood, making a boundary that might hold. You can step through alone to pull Mara out, accepting whatever role waits inside. Or you can shatter the glass and run, hoping the ward's reach ends at the gate. Mara's mouth forms one last silent sentence: \"It learns.\"","choices":{"choice-51":{"text":"Cut your palm and seal the mirror with blood"},"choice-52":{"text":"Step through the mirror alone to free Mara"},"choice-53":{"text":"Shatter the glass, then run without looking back"}}},"node-26":{"title":"Fire, Evidence, or Mercy","narration":"A storage closet has been turned into an archive. Boxes of tapes are stacked to the ceiling, each labeled with a name, a date, and a time stamped 2:17. Your own name appears on a fresh label, ink still glossy. A metal bin holds burnt cassette shells. Someone has tried to starve the ward, or erase proof. The smell of melted plastic mixes with bleach, nauseating and sweet. A corkboard displays clippings about missing people, spanning decades. The pattern is not random. Hollow Ward has been taking visitors for years, and the world has called it coincidence. On a table lies a lighter and a half-written confession signed \"D. Sable.\" It describes experiments: using recorded voices to overwrite consent, turning grief into a tool, keeping echoes contained by feeding them. Your hands shake. If you burn the tapes, you might cut the ward's power but destroy evidence. If you carry them out, you might expose the truth, but you may be carrying the ward with you, like a parasite on magnetic tape. And if you bargain for mercy - for forgetting - you might save your life by erasing the reason you came.","choices":{"choice-54":{"text":"Burn Sable's tapes and lock the ward forever"},"choice-55":{"text":"Carry the evidence out and call the press"},"choice-56":{"text":"Spare the ward, bargain to erase your memory"}}},"node-27":{"title":"Escape with an Echo","narration":"You do not fight the ward on its terms; you make your own. Whether you seal the mirror with blood or bargain for a clean exit, you find yourself moving fast, guided by instincts that do not feel entirely yours. The hallway seems to shorten, doors unlocking a beat before you reach them, as if the building is eager to spit you out now that it has taken its payment. Mara stumbles beside you, real and warm, her fingers crushing yours with desperate strength. She will not look at any reflective surface. When you pass a broken window, she flinches as if it were a mouth. Outside, the night air tastes like rust and pine. The fence gap is exactly where you left it. Lang's cruiser, if he was with you, is there but empty, its radio hissing softly in the dark. Jonah's chalk marks, if he came, are smeared as if by wet hands. You reach the road and the hospital recedes into silhouette. For a moment you think you made it. Then your phone, which should be dead, lights up and begins recording. The waveform spikes, shaping a familiar pattern. Mara squeezes your hand and whispers, \"It follows sound.\" Her voice is wrong - layered, doubled, like a tape played over itself. When she says your name, you hear it echoed from the direction of the hospital, perfectly timed, as if something inside is practicing the distance. You got her out, and you are alive. But in the quiet between your breaths, you hear the metronome click again, steady and patient, counting down to a future appointment that now lives inside you.","choices":{}},"node-28":{"title":"You Become the Warden","narration":"You step through the mirror and the world changes texture. The air becomes thick, like water. The lights hum at a frequency that presses into your bones. Behind you, Mara's face is a bright patch of pain, and then the glass seals like skin closing over a wound. Ward Zero is not a place so much as a loop of rooms that remember. Voices drift through the walls in layers: patients crying, staff soothing, Mara pleading, your own voice promising things you have not yet promised. Dr. Sable appears as a calm outline, a coat filled with shadow. It does not look triumphant. It looks relieved. \"We require continuity,\" it says, and you realize the ward is an institution without a body, a procedure that needs a person to execute it. It gives you a badge with your name printed under the title WARDEN. The badge is cold and heavy. When you clip it on, the building's attention relaxes around you like a satisfied animal. Doors open. Lights steady. The metronome slows. In the observation room, Mara stands on the safe side of the mirror now, sobbing with gratitude and horror. The intercom tells her she is discharged. The front gate unlocks for her alone. You try to speak, to tell her to run, but your voice comes out in Dr. Sable's cadence, soothing, professional, inevitable. Mara leaves because she has to live. The ward does not stop her. It has what it wanted. When the last of her footsteps fades, you feel the building fill you with a new vocabulary: schedules, protocols, and the hungry need to keep the echoes from leaking. Somewhere in the dark, a new voicemail begins to record, and you realize you are the one who will send it.","choices":{}},"node-29":{"title":"The Ward Burns Clean","narration":"You choose fire because it is the only language the ward does not control. You stack the tapes, the journals, the clippings - every magnetic spine of memory - into the bin and strike the lighter. The flame catches fast, licking plastic and paper, coughing black smoke that tastes like melted childhood. The ward reacts like a body in pain. Lights flare, then die. Doors slam in distant sequence. The hum turns into a strained whine. For a moment you think it will trap you, but locks click open as if the building is desperate to vent the heat. You run, dragging whoever is with you, guided by a single instinct: out. The corridors that looped now become linear, stripped of cleverness. The metronome click stutters, misses beats, then stops. Silence crashes down. Behind you, flames crawl up the stairwell, reflecting in broken tiles like a swarm of orange insects. Smoke pours from vents, and with it come voices - not coherent words, but a rush of released recordings venting into the night. At the gate, heat is a physical shove. Windows bloom with light and then burst. For a second you see faces in the smoke, mouths open, not screaming but exhaling. Then the roof gives in with a deep groan, and the ward collapses into itself, like a closing fist. You survive. The truth is gone, reduced to soot, but the cycle is broken. As dawn stains the sky, the ward is finally quiet, and your thoughts sound like they belong to you again.","choices":{}},"node-30":{"title":"The Road Loops Forever","narration":"You break the mirror and run, refusing every deal, every rule, every ritual. Glass explodes in a bright, sharp rain. Mara's scream cuts through the building like a blade. For a heartbeat you think you have done it - shattered the membrane, freed her by force. Then the hallway tilts. The lights blink, and when they come back, you are at the lobby. The reception desk is whole again. The ledger is blank. The clock reads 2:17. You sprint to the front doors. They open onto the night, and you burst out into cold air, lungs burning. The road is there. The trees are there. The fence gap is there. You run until your legs shake, until you see your own car's silhouette and relief floods you. Your keys are in your hand. You press unlock. The car chirps once. The headlights flash - and in that flash you see the hospital gate in your rearview mirror, impossibly close. You are back where you started. The ward has not chased you; it has rewound you. It does not need chains when it owns the timeline. You try again. Each time, something changes in small ways: a new scratch on your knuckle, a missing memory of a room, Mara's voicemail shifting to include a new sentence that anticipates your attempt. The building is editing you, trimming away resistance with every loop. On the seventh run, you realize you cannot remember why you are here. The phone in your pocket plays a voicemail from someone you almost recognize, begging you to come. The metronome clicks. The gate is open. You step forward because the story is all you have left. In the dark window of the lobby, your reflection smiles first.","choices":{}},"node-31":{"title":"Truth at a Terrible Price","narration":"You carry the evidence because the world outside needs to know what Hollow Ward does. You gather tapes, Sable's journal, the confession letter, anything with ink and magnetic memory. Your bag is heavy, and with each step the weight feels less like objects and more like a presence. The ward tries to distract you - doors opening to show Mara, voices calling, the scent of bleach intensifying until your eyes water - but you keep moving. If Mara is with you, she grips your sleeve and repeats a rule under her breath: \"No mirrors.\" If she is not, you repeat it yourself, because the ward has already started borrowing your voice. You reach the gate as the sky begins to pale. For a moment, it feels like escape. Then your phone rings with a call from your own number. When you answer by reflex, you hear Dr. Sable's calm voice reading your personal history like a case file. It knows your address and the sentence you think when you cannot sleep. You hang up, shaking, and keep walking. The ward does not stop you because it has already copied what it needs. Weeks later, the investigation ignites. Journalists print your photos. Officials schedule demolition. Then one night, a voicemail appears on your phone with no missed call. It is your voice, soothing and professional, inviting someone to an appointment at 2:17. You exposed the truth, but the price is intimate: you can never trust your voice again.","choices":{}}}}